In [2]:
import pandas as pd
import numpy as np

In [3]:
forum_users={
    'User_Id':np.array([1,2,3,4,5,6]),
    'Username':['oleksandr_s','tom_lankaster','data_drui','ganlui_de_prua','yunli_lio_dzo' ,'none_user'],
    'Age':[23,21,14,99,34,None],
    'Joined Date':pd.to_datetime(['2029-03-11','2028-05-03','2038-03-01','2010-06-06','2100-05-02',None]),
    'Total Posts':[100,105,129,120,9,105],
    'Reputation': [200,289,900,20,45,203],
}
df=pd.DataFrame(forum_users)
df

   User_Id        Username   Age Joined Date  Total Posts  Reputation
0        1     oleksandr_s  23.0  2029-03-11          100         200
1        2   tom_lankaster  21.0  2028-05-03          105         289
2        3       data_drui  14.0  2038-03-01          129         900
3        4  ganlui_de_prua  99.0  2010-06-06          120          20
4        5   yunli_lio_dzo  34.0  2100-05-02            9          45
5        6       none_user   NaN         NaT          105         203

# Filtering

In [4]:
df[['Username',"Age"]]

         Username   Age
0     oleksandr_s  23.0
1   tom_lankaster  21.0
2       data_drui  14.0
3  ganlui_de_prua  99.0
4   yunli_lio_dzo  34.0
5       none_user   NaN

In [5]:
df.loc[3]

User_Id                          4
Username            ganlui_de_prua
Age                           99.0
Joined Date    2010-06-06 00:00:00
Total Posts                    120
Reputation                      20
Name: 3, dtype: object

In [6]:
type(df.loc[3])

pandas.core.series.Series

In [7]:
df.loc[2:4]

   User_Id        Username   Age Joined Date  Total Posts  Reputation
2        3       data_drui  14.0  2038-03-01          129         900
3        4  ganlui_de_prua  99.0  2010-06-06          120          20
4        5   yunli_lio_dzo  34.0  2100-05-02            9          45

In [8]:
df.loc[2:4,['Username','Joined Date','Reputation']]

         Username Joined Date  Reputation
2       data_drui  2038-03-01         900
3  ganlui_de_prua  2010-06-06          20
4   yunli_lio_dzo  2100-05-02          45

In [9]:
df.iloc[3]

User_Id                          4
Username            ganlui_de_prua
Age                           99.0
Joined Date    2010-06-06 00:00:00
Total Posts                    120
Reputation                      20
Name: 3, dtype: object

In [10]:
df.iloc[2:4]

   User_Id        Username   Age Joined Date  Total Posts  Reputation
2        3       data_drui  14.0  2038-03-01          129         900
3        4  ganlui_de_prua  99.0  2010-06-06          120          20

In [11]:
df.iloc[2:4, 1:4]

         Username   Age Joined Date
2       data_drui  14.0  2038-03-01
3  ganlui_de_prua  99.0  2010-06-06

In [12]:
df.iloc[2:4, [1,2,3,5]]

         Username   Age Joined Date  Reputation
2       data_drui  14.0  2038-03-01         900
3  ganlui_de_prua  99.0  2010-06-06          20

In [13]:
df.iloc[:, [1,2,3,5]]

         Username   Age Joined Date  Reputation
0     oleksandr_s  23.0  2029-03-11         200
1   tom_lankaster  21.0  2028-05-03         289
2       data_drui  14.0  2038-03-01         900
3  ganlui_de_prua  99.0  2010-06-06          20
4   yunli_lio_dzo  34.0  2100-05-02          45
5       none_user   NaN         NaT         203

In [14]:
df[df['Age']>=25]

   User_Id        Username   Age Joined Date  Total Posts  Reputation
3        4  ganlui_de_prua  99.0  2010-06-06          120          20
4        5   yunli_lio_dzo  34.0  2100-05-02            9          45

In [15]:
df['Age']>=25

0    False
1    False
2    False
3     True
4     True
5    False
Name: Age, dtype: bool

In [16]:
df[df['Reputation']<=200]

   User_Id        Username   Age Joined Date  Total Posts  Reputation
0        1     oleksandr_s  23.0  2029-03-11          100         200
3        4  ganlui_de_prua  99.0  2010-06-06          120          20
4        5   yunli_lio_dzo  34.0  2100-05-02            9          45

In [17]:
df[df['Total Posts']==105]

   User_Id       Username   Age Joined Date  Total Posts  Reputation
1        2  tom_lankaster  21.0  2028-05-03          105         289
5        6      none_user   NaN         NaT          105         203

In [18]:
df[(df['Reputation']<=200)|(df['Total Posts']==105)]

   User_Id        Username   Age Joined Date  Total Posts  Reputation
0        1     oleksandr_s  23.0  2029-03-11          100         200
1        2   tom_lankaster  21.0  2028-05-03          105         289
3        4  ganlui_de_prua  99.0  2010-06-06          120          20
4        5   yunli_lio_dzo  34.0  2100-05-02            9          45
5        6       none_user   NaN         NaT          105         203

In [19]:
(df['Reputation']<=200)|(df['Total Posts']==105)

0     True
1     True
2    False
3     True
4     True
5     True
dtype: bool

In [20]:
df[(df['Age']>=25)&(df['Reputation']<=200)]

   User_Id        Username   Age Joined Date  Total Posts  Reputation
3        4  ganlui_de_prua  99.0  2010-06-06          120          20
4        5   yunli_lio_dzo  34.0  2100-05-02            9          45

In [24]:
df['Reputation'].isin([200,20,900])

0     True
1    False
2     True
3     True
4    False
5    False
Name: Reputation, dtype: bool

In [22]:
df[df['Reputation'].isin([200,20,900])]

   User_Id        Username   Age Joined Date  Total Posts  Reputation
0        1     oleksandr_s  23.0  2029-03-11          100         200
2        3       data_drui  14.0  2038-03-01          129         900
3        4  ganlui_de_prua  99.0  2010-06-06          120          20

In [30]:
df[df['Reputation'].isin(range(40,201))]

   User_Id       Username   Age Joined Date  Total Posts  Reputation
0        1    oleksandr_s  23.0  2029-03-11          100         200
4        5  yunli_lio_dzo  34.0  2100-05-02            9          45

In [35]:
date_range=pd.date_range(start='2025-03-09',end='2030-01-01')
data_range

DatetimeIndex(['2025-03-09', '2025-03-10', '2025-03-11', '2025-03-12',
               '2025-03-13', '2025-03-14', '2025-03-15', '2025-03-16',
               '2025-03-17', '2025-03-18',
               ...
               '2029-12-23', '2029-12-24', '2029-12-25', '2029-12-26',
               '2029-12-27', '2029-12-28', '2029-12-29', '2029-12-30',
               '2029-12-31', '2030-01-01'],
              dtype='datetime64[ns]', length=1760, freq='D')

In [36]:
df[df['Joined Date'].isin (date_range)]

   User_Id       Username   Age Joined Date  Total Posts  Reputation
0        1    oleksandr_s  23.0  2029-03-11          100         200
1        2  tom_lankaster  21.0  2028-05-03          105         289

## Sorting

In [37]:
df.sort_values(by='Age')

   User_Id        Username   Age Joined Date  Total Posts  Reputation
2        3       data_drui  14.0  2038-03-01          129         900
1        2   tom_lankaster  21.0  2028-05-03          105         289
0        1     oleksandr_s  23.0  2029-03-11          100         200
4        5   yunli_lio_dzo  34.0  2100-05-02            9          45
3        4  ganlui_de_prua  99.0  2010-06-06          120          20
5        6       none_user   NaN         NaT          105         203

In [39]:
df.sort_values(by='Joined Date',ascending=False)

   User_Id        Username   Age Joined Date  Total Posts  Reputation
4        5   yunli_lio_dzo  34.0  2100-05-02            9          45
2        3       data_drui  14.0  2038-03-01          129         900
0        1     oleksandr_s  23.0  2029-03-11          100         200
1        2   tom_lankaster  21.0  2028-05-03          105         289
3        4  ganlui_de_prua  99.0  2010-06-06          120          20
5        6       none_user   NaN         NaT          105         203

In [40]:
# df.sort_values(by=1,axis=1)
#TypeError: '>' not supported between instances of 'numpy.ndarray' and 'str'

TypeError: '>' not supported between instances of 'numpy.ndarray' and 'str'

In [41]:
df[["User_Id","Age","Total Posts","Reputation"]]

   User_Id   Age  Total Posts  Reputation
0        1  23.0          100         200
1        2  21.0          105         289
2        3  14.0          129         900
3        4  99.0          120          20
4        5  34.0            9          45
5        6   NaN          105         203

In [45]:
#sort by values in the row with index 2
df[["User_Id","Age","Total Posts","Reputation"]].sort_values(2,axis=1,ascending=False)

   Reputation  Total Posts   Age  User_Id
0         200          100  23.0        1
1         289          105  21.0        2
2         900          129  14.0        3
3          20          120  99.0        4
4          45            9  34.0        5
5         203          105   NaN        6